package com.guodf.owner.common.constant;


/**
 * 常量类
 */
public class BaseConstant {
	
	/** paramerString 中memcached_key对应名字 */
	public static final String REQ_MEM_KEY = "mem_key";
	
	/** 渠道标识sys_id传入错误或当前功能不支持时提示语 */
	public static final String TIP_NO_SYS = "很抱歉，此功能不支持当前渠道业务";
	
	/** 操作结果 成功标识 **/
	public static final int SUCCESS = 0;
	/** 操作结果 成功提示语 **/
	public static final String SUCC_MSG = "操作成功";
	/** 操作结果 失败 **/
	public static final int FAIL = 1;
	/** 操作结果 失败提示语 **/
	public static final String FAIL_MSG = "数据获取失败，请稍后重试";
	
	/** 业务状态值：成功 */
	public static final String BUSI_STEP_SUCC = "999";
	
	/** 业务状态值：失败 */
	public static final String BUSI_STEP_FAIL = "-999";
	
	/** 统计主体标识串长度 **/
	public static final int TERM_KEY_LENGTH = 5;
	
	/** 入参时间类型：按年 */
	public static final String DATE_TYPE_YEAR = "Y";
	/** 入参时间类型：按季度 */
	public static final String DATE_TYPE_QUARTER = "Q";
	/** 入参时间类型：按周*/
	public static final String DATE_TYPE_WEEK = "W";
	/** 入参时间类型：按月 */
	public static final String DATE_TYPE_MONTH = "M";
	/** 入参时间类型：按日 */
	public static final String DATE_TYPE_DAY = "D";
	/** 时间范围标识 **/
	public static final String DATE_TYPE_RANGE = "R";
	
	/** 规则ID：时间区间 **/
	public static final String RULE_ID_RANGE = "10001";
	/** 规则ID：周 **/
	public static final String RULE_ID_WEEK = "10002";
	/** 规则ID：月 **/
	public static final String RULE_ID_MONTH = "10003";
	/** 规则ID：年 **/
	public static final String RULE_ID_YEAR = "10004";
	
	/** 日期格式 **/
	public static final String DATE_FORMAT = "yyyyMMdd";
	/** 日期格式 yM **/
	public static final String DATE_FORMAT_YM = "yyyyMM";
	/** 展示日期格式 **/
	public static final String DATE_FORMAT_SHOW = "yyyy/MM/dd";
	/** 今天 **/
	public static final String DATE_TODAY = "0";
	/** 日期选择 全集 **/
	public static final String DATE_TYPE_REG = DATE_TODAY + ",1,7,30," + DATE_TYPE_RANGE + "," + DATE_TYPE_MONTH;
	
	
	/** 按时 全集 **/
	public static final String[] HOURS = {"00","01","02","03","04","05","06","07","08","09",
			"10","11","12","13","14","15","16","17","18","19","20","21","22","23"};
	/** 按年 全集 **/
	public static final String[] MONTHS = {"01","02","03","04","05","06","07","08","09","10","11","12"};
	/** 按周 全集 **/
	public static final String[] WEEKS = {"Mon.","Tues.","Wed.","Thur.","Fri.","Sat.","Sun."};
	
	/** 是否对比标识 0-不对比 **/
	public static final String COMPARE_FLAG_N = "0";
	/** 是否对比标识 1-对比 **/
	public static final String COMPARE_FLAG_Y = "1";
	/** 是否对比标识 全集 **/
	public static final String COMPARE_FLAG_REG = COMPARE_FLAG_N + "," + COMPARE_FLAG_Y;

	
	/** 访客类型 0-全部 **/
	public static final String VISITOR_TYPE_ALL = "0";
	/** 访客类型 1-新访客 **/
	public static final String VISITOR_TYPE_NEW = "1";
	/** 访客类型 2-老访客 **/
	public static final String VISITOR_TYPE_OLD = "2";
	/** 访客类型 全集 **/
	public static final String VISITOR_TYPE_REG = VISITOR_TYPE_ALL +","+ VISITOR_TYPE_NEW +","+ VISITOR_TYPE_OLD;

	
	/** 用户性别集合 **/	
	public static final String [] SEX_RANGE = {"sex_f","sex_m","unknown"};
	/** 用户网龄集合**/
	public static final int [] NET_RANGE = {1,2,3,4,5,0,-1};	//0-代表5年以上的网龄,-1代表unknown
	/** 用户年龄积集合**/
	public static final int [][] AGE_RANGE =  {{20},{20,30},{30,40},{40,50},{50},{-1}};	//50代表50岁以上,-1代表unknown
	/**用户约消费水平 **/
	public static final int [][] MONTH_FEE_RANGE =  {{0,20},{20,50},{50,100},{100,150},{150,200},{200},{-1}}; 	//200代表200元以上,-1代表unknown
	/**新老用户购买次数分层*/
	public static final int[][] USER_BUY_NUM = {{1,1},{2,2},{3,5},{5,10},{10}};
	/**三大运营商配置*/
	public static final String NET_OPERATOR ="移动%联通%电信%其他";
	/**商品浏览数*/
	public static final int [] GOODS_NUM  = {0,3,5,10,15};
	
	/** 用户群*/
	public static final String [][] USER_GROUP = {{"充缴业务","G_PAY"},{"查询业务","G_QRY"},{"流量/预存业务","G_OPT"},{"宽带业务","G_BROAD"}};
	/** 充缴业务用户群*/
	public static final String [][] G_PAY = {{"每月一次","G_pay_1"},{"每月两次及以上","G_pay_2"},{"两月一次","G_pay_3"},{"两月两次及以上","G_pay_4"},{"三月一次","G_pay_5"},{"三月两次及以上","G_pay_6"}};
	/** 查询业务用户群*/
	public static final String [][] G_QRY = {{"每周查询话费套餐两次以上","G_qry_1"},{"每月查询话费用量套餐，账单箱单各一次","G_qry_2"}};
	/** 流量/预存用户群*/
	public static final String [][] G_OPT = {{"流量包每月两次及以上","G_opt_1"},{"预存赠费类业务每月一次","G_opt_2"}};
	/** 宽带业务用户群*/
	public static final String [][] G_BROAD = {{"用户入网之后一直在网厅或掌厅续费,没有使用过其他渠道续费","G_broad_1"}};
	
	
	/** 终端设备类型 全集 0-全部,1-PC,2-移动设备 **/
	public static final String DEVICE_TYPE_REG = "0,1,2";
	
	
	/** 浏览器类型 全集 0-全部,1-IE,2-Chrome,3-Firefox,4-Safari,5-Opera,6-其它 **/
//	public static final String BROWSER_TYPE_REG = "0,1,2,3,4,5,6";

	
	/** 屏幕分辨率类型 全集 0-全部,1-1440x900,2-1366x768,3-1920x1080,4-1600x900,5-1280x800,6-1024x768,7-1680x1050,8-1280x720,9-其它 **/
//	public static final String SCREEN_TYPE_REG = "0,1,2,3,4,5,6,7,8,9";
	
	
	/** 统计类型 H-按时 **/
	public static final String STATS_TYPE_HOUR = "H";
	/** 统计类型 D-按日 **/
	public static final String STATS_TYPE_DAY = "D";
	/** 统计类型 W-按周 **/
	public static final String STATS_TYPE_WEEK = "W";
	/** 统计类型 M-按月 **/
	public static final String STATS_TYPE_MONTH = "M";
	/** 统计类型 Y-按年 **/
	public static final String STATS_TYPE_YEAR = "Y";
	/** 统计类型 全集 **/
	public static final String STATS_TYPE_REG = STATS_TYPE_HOUR +","+ STATS_TYPE_DAY +","+ STATS_TYPE_WEEK +","+ STATS_TYPE_MONTH +","+ STATS_TYPE_YEAR;

	
	/**用户属性  手机号码运营商*/
	/**中国电信号码格式验证 手机段： 133,153,180,181,189,177,1700,173   */
	public static final String TELECOM_PATTERN = "(?:^(?:\\+86)?1(?:33|53|7[37]|8[019])\\d{8}$)|(?:^(?:\\+86)?1700\\d{7}$)";
	/**中国联通号码格式验证 手机段：130,131,132,155,156,185,186,145,176,1707,1708,1709,175 */
	public static final String UNICOM_PATTERN = "(?:^(?:\\+86)?1(?:3[0-2]|4[5]|5[56]|7[56]|8[56])\\d{8}$)|(?:^(?:\\+86)?170[7-9]\\d{7}$)";  
	/**中国移动号码格式验证 手机段：134,135,136,137,138,139,150,151,152,157,158,159,182,183,184,187,188,147,178,1705 */
	public static final String MOBILE_PATTERN = "(?:^(?:\\+86)?1(?:3[4-9]|4[7]|5[0-27-9]|7[8]|8[2-478])\\d{8}$)|(?:^(?:\\+86)?1705\\d{7}$)";

	/** hbase 分隔符 **/
	public static final String HBASE_SPLIT ="\\^\\^";

	/** 指标 枚举 **/
	public static enum TARGET{
		/**浏览量**/
		pv,
		/**浏览量占比?**/
		pvPer,
		/**访问次数**/
		visitscount,
		/**访客数**/
		uv,
		/**新访客数**/
		newVistor,
		/**老访客数**/
		oldVistor,
		/**新访客比率*newVistor/uv*/
		newVistorPer,
		/**IP数**/
		ip,
		/**跳出次数**/
		jumpCount,
		/**跳出率*jumpCount/pv*/
		jumpPer,
		/**访问时长**/
		pageTime,
		/**平均访问时长**/
		pageTimeAvg,
		/**访问页数**/
		pageCount,
		/**平均访问页数*pv/visits*/
		pageCountAvg,
		/**访问深度**/
		pageDepth,
		/**上次访问时间**/
		recentTime,
		/**转化次数**/
		transCount,
		/**转化率**/
		transPer,
		/**访问频次**/
		sessionCount,
		/**退出次数**/
		exitCount,
		/**退出率**/
		exitPer,
		/**入口页次数**/
		topPageCount,
		/**贡献下游浏览量**/
		outWardCount,
		/**访客率**/
		vistorPer,
		/**热力图**/
		pos;
		
		// Hbase 表中column为纯小写，特增加此方法
		public String toLower(){
			return this.toString().toLowerCase();
		}
	}
	/** 基本指标（无需计算，可直接从hbase获取数据） **/
	public static final String TARGET_BASE = TARGET.pv.toLower() +","+
											 TARGET.visitscount.toLower() +","+
											 TARGET.uv.toLower() +","+
											 TARGET.newVistor.toLower() +","+
											 TARGET.oldVistor.toLower() +","+
											 TARGET.ip.toLower() +","+
											 TARGET.jumpCount.toLower() +","+
											 TARGET.pageTime.toLower() +","+
//											 TARGET.pageTimeAvg.toLower() +","+
											 TARGET.pageCount.toLower() +","+
											 TARGET.pageDepth.toLower() +","+
											 TARGET.recentTime.toLower() +","+
											 TARGET.transCount.toLower() +","+
											 TARGET.transPer.toLower() +","+
											 TARGET.sessionCount.toLower() +","+
											 TARGET.topPageCount.toLower() +","+
											 TARGET.outWardCount.toLower() +","+
											 TARGET.exitCount.toLower() +","+
											 TARGET.pos.toLower();
	
	/**全国地市信息map，用于出参选择*/
	public static final String trans = "{21_2106=辽宁省丹东市,15_1525= 内蒙古锡林郭勒盟,32_3213= 江苏省宿迁市,35_3509= 福建省宁德市,44_4451= 广东省潮州市,53_5303= 云南省曲靖市,42_4203= 湖北省十堰市,13_1307= 河北省张家口市,62_6203= 甘肃省金昌市,36_3605= 江西省新余市,31_310113= 上海市宝山区,14_1404= 山西省长治市,36_3608= 江西省吉安市,43_4303= 湖南省湘潭市,45_4512= 广西壮族自治区河池市,43_4311= 湖南省永州市,62_6207= 甘肃省张掖市,64_6401= 宁夏银川市,33_3305= 浙江省湖州市,62_6208= 甘肃省平凉市,50_500110= 重庆市万盛区,65_6502= 新疆克拉玛依市,34_3411= 安徽省滁州市,13_1308= 河北省承德市,44_4452= 广东省揭阳市,23_2301= 黑龙江省哈尔滨市,11_110107= 北京市石景山区,65_6540= 新疆伊犁哈萨克自治州,52_5222= 贵州省铜仁地区,50_500226= 重庆市荣昌县,50_500223= 重庆市潼南县,36_3604= 江西省九江市,65_6532= 新疆和田地区,31_310106= 上海市静安区,22_2203= 吉林省四平市,53_5333= 云南省怒江傈僳族自治州,50_500235= 重庆市云阳县,11_110106= 北京市丰台区,44_4420= 广东省中山市,52_5204= 贵州省安顺市,52_5223= 贵州省黔西南布依族苗族自治州,12_120101= 天津市和平区,51_5110= 四川省内江市,33_3309= 浙江省舟山市,42_4207= 湖北省鄂州市,34_3404= 安徽省淮南市,61_6101= 陕西省西安市,37_3706= 山东省烟台市,23_2312= 黑龙江省绥化市,63_6322= 青海省海北藏族自治州,31_310118= 上海市青浦区,41_4107= 河南省新乡市,61_6103= 陕西省宝鸡市,53_5334= 云南省迪庆藏族自治州,36_3602= 江西省景德镇市,44_4453= 广东省云浮市,23_2308= 黑龙江省佳木斯市,42_4212= 湖北省咸宁市,32_3208= 江苏省淮安市,65_6590= 新疆自治区直辖县级行政区划,13_1302= 河北省唐山市,65_6531= 新疆喀什地区,11_110113= 北京市顺义区,41_4104= 河南省平顶山市,12_1202= 天津市县,33_3311= 浙江省丽水市,12_120225= 天津市蓟县,31_310120= 上海市奉贤区,45_4511= 广西壮族自治区贺州市,37_3711= 山东省日照市,37_3708= 山东省济宁市,37_3704= 山东省枣庄市,54_5401= 西藏拉萨市,23_2309= 黑龙江省七台河市,12_120106= 天津市红桥区,50_500228= 重庆市梁平县,14_1411= 山西省吕梁市,51_5114= 四川省眉山市,63_6323= 青海省黄南藏族自治州,34_3406= 安徽省淮北市,15_1505= 内蒙古通辽市,65_6523= 新疆昌吉回族自治州,51_5101= 四川省成都市,36_3607= 江西省赣州市,41_4116= 河南省周口市,61_6108= 陕西省榆林市,23_2302= 黑龙江省齐齐哈尔市,50_500236= 重庆市奉节县,34_3403= 安徽省蚌埠市,50_500227= 重庆市璧山县,22_2208= 吉林省白城市,14_1402= 山西省大同市,14_1407= 山西省晋中市,62_6201= 甘肃省兰州市,32_3204= 江苏省常州市,12_120221= 天津市宁河县,11_110101= 北京市东城区,35_3503= 福建省莆田市,15_1522= 内蒙古兴安盟,50_500113= 重庆市巴南区,34_3417= 安徽省池州市,22_2207= 吉林省松原市,50_500108= 重庆市南岸区,54_5425= 西藏阿里地区,50_500229= 重庆市城口县,31_310116= 上海市金山区,44_4415= 广东省汕尾市,51_5119= 四川省巴中市,13_1304= 河北省邯郸市,11_1101= 北京市市辖区,11_1102= 北京市县,11_110228= 北京市密云县,53_5306= 云南省昭通市,42_4201= 湖北省武汉市,41_4101= 河南省郑州市,44_4414= 广东省梅州市,44_4417= 广东省阳江市,51_5133= 四川省甘孜藏族自治州,21_2114= 辽宁省葫芦岛市,63_6321= 青海省海东地区,63_6326= 青海省果洛藏族自治州,37_3710= 山东省威海市,36_3603= 江西省萍乡市,32_3212= 江苏省泰州市,50_500118= 重庆市永川区,35_3501= 福建省福州市,31_3101= 上海市市辖区,33_3301= 浙江省杭州市,45_4505= 广西壮族自治区北海市,54_5423= 西藏日喀则地区,31_310115= 上海市浦东新区,51_5115= 四川省宜宾市,50_500117= 重庆市合川区,53_5331= 云南省德宏傣族景颇族自治州,34_3410= 安徽省黄山市,12_120103= 天津市河西区,37_3712= 山东省莱芜市,31_310108= 上海市闸北区,44_4412= 广东省肇庆市,52_5226= 贵州省黔东南苗族侗族自治州,21_2104= 辽宁省抚顺市,43_4313= 湖南省娄底市,44_4408= 广东省湛江市,14_1410= 山西省临汾市,31_310103= 上海市卢湾区,13_1311= 河北省衡水市,41_4111= 河南省漯河市,50_5002= 重庆市县,63_6327= 青海省玉树藏族自治州,51_5108= 四川省广元市,11_110109= 北京市门头沟区,15_1508= 内蒙古巴彦淖尔市,65_6528= 新疆巴音郭楞蒙古自治州,50_500103= 重庆市渝中区,65_6542= 新疆塔城地区,32_3206= 江苏省南通市,65_6543= 新疆阿勒泰地区,42_4211= 湖北省黄冈市,12_120104= 天津市南开区,43_4331= 湖南省湘西土家族苗族自治州,50_500234= 重庆市开县,35_3502= 福建省厦门市,64_6405= 宁夏中卫市,51_5116= 四川省广安市,46_4690= 海南省省直辖县级行政区划,63_6301= 青海省西宁市,31_310112= 上海市闵行区,21_2101= 辽宁省沈阳市,62_6210= 甘肃省庆阳市,65_6527= 新疆博尔塔拉蒙古自治州,15_1503= 内蒙古乌海市,31_310107= 上海市普陀区,51_5120= 四川省资阳市,22_2224= 吉林省延边朝鲜族自治州,53_5307= 云南省丽江市,61_6102= 陕西省铜川市,37_3701= 山东省济南市,36_3606= 江西省鹰潭市,50_500115= 重庆市长寿区,12_120111= 天津市西青区,44_4405= 广东省汕头市,37_3714= 山东省德州市,50_500225= 重庆市大足县,43_4302= 湖南省株洲市,51_5105= 四川省泸州市,31_310101= 上海市黄浦区,51_5107= 四川省绵阳市,33_3307= 浙江省金华市,51_5134= 四川省凉山彝族自治州,53_5326= 云南省文山壮族苗族自治州,33_3306= 浙江省绍兴市,42_4213= 湖北省随州市,44_4402= 广东省韶关市,50_500112= 重庆市渝北区,11_110105= 北京市朝阳区,50_500231= 重庆市垫江县,32_3209= 江苏省盐城市,41_4113= 河南省南阳市,37_3705= 山东省东营市,36_3611= 江西省上饶市,64_6403= 宁夏吴忠市,50_500104= 重庆市大渡口区,13_1303= 河北省秦皇岛市,61_6110= 陕西省商洛市,31_310105= 上海市长宁区,12_120105= 天津市河北区,50_500106= 重庆市沙坪坝区,45_4502= 广西壮族自治区柳州市,50_500238= 重庆市巫溪县,15_1529= 内蒙古阿拉善盟,31_310230= 上海市崇明县,32_3201= 江苏省南京市,32_3205= 江苏省苏州市,53_5301= 云南省昆明市,63_6328= 青海省海西蒙古族藏族自治州,50_500224= 重庆市铜梁县,51_5132= 四川省阿坝藏族羌族自治州,64_6402= 宁夏石嘴山市,14_1405= 山西省晋城市,32_3210= 江苏省扬州市,33_3310= 浙江省台州市,22_2205= 吉林省通化市,50_500116= 重庆市江津区,61_6105= 陕西省渭南市,52_5227= 贵州省黔南布依族苗族自治州,31_310109= 上海市虹口区,44_4406= 广东省佛山市,53_5304= 云南省玉溪市,42_4290= 湖北省省直辖县级行政区划,44_4419= 广东省东莞市,34_3418= 安徽省宣城市,51_5109= 四川省遂宁市,23_2306= 黑龙江省大庆市,44_4401= 广东省广州市,35_3505= 福建省泉州市,42_4206= 湖北省襄樊市,34_3413= 安徽省宿州市,45_4508= 广西壮族自治区贵港市,21_2111= 辽宁省盘锦市,63_6325= 青海省海南藏族自治州,50_500114= 重庆市黔江区,22_2202= 吉林省吉林市,32_3202= 江苏省无锡市,23_2327= 黑龙江省大兴安岭地区,15_1504= 内蒙古赤峰市,50_5001= 重庆市市辖区,12_120116= 天津市滨海新区,13_1306= 河北省保定市,12_1201= 天津市市辖区,35_3508= 福建省龙岩市,14_1401= 山西省太原市,44_4407= 广东省江门市,45_4513= 广西壮族自治区来宾市,51_5113= 四川省南充市,35_3506= 福建省漳州市,44_4416= 广东省河源市,12_120223= 天津市静海县,43_4306= 湖南省岳阳市,52_5203= 贵州省遵义市,33_3308= 浙江省衢州市,65_6529= 新疆阿克苏地区,41_4108= 河南省焦作市,14_1409= 山西省忻州市,13_1309= 河北省沧州市,41_4190= 河南省省直辖县级行政区划,65_6521= 新疆吐鲁番地区,12_120114= 天津市武清区,50_500222= 重庆市綦江县,35_3507= 福建省南平市,21_2112= 辽宁省铁岭市,32_3211= 江苏省镇江市,11_110112= 北京市通州区,21_2110= 辽宁省辽阳市,43_4307= 湖南省常德市,12_120115= 天津市宝坻区,65_6530= 新疆克孜勒苏柯尔克孜自治州,53_5308= 云南省普洱市,44_4409= 广东省茂名市,33_3302= 浙江省宁波市,34_3416= 安徽省亳州市,41_4115= 河南省信阳市,37_3717= 山东省菏泽市,43_4308= 湖南省张家界市,11_110102= 北京市西城区,53_5309= 云南省临沧市,35_3504= 福建省三明市,14_1406= 山西省朔州市,53_5328= 云南省西双版纳傣族自治州,36_3609= 江西省宜春市,11_110117= 北京市平谷区,14_1403= 山西省阳泉市,52_5201= 贵州省贵阳市,15_1507= 内蒙古呼伦贝尔市,44_4403= 广东省深圳市,36_3610= 江西省抚州市,42_4202= 湖北省黄石市,34_3408= 安徽省安庆市,21_2103= 辽宁省鞍山市,23_2311= 黑龙江省黑河市,37_3716= 山东省滨州市,37_3715= 山东省聊城市,32_3203= 江苏省徐州市,46_4602= 海南省三亚市,23_2310= 黑龙江省牡丹江市,62_6202= 甘肃省嘉峪关市,15_1501= 内蒙古呼和浩特市,42_4205= 湖北省宜昌市,42_4208= 湖北省荆门市,53_5329= 云南省大理白族自治州,37_3707= 山东省潍坊市,12_120112= 天津市津南区,41_4110= 河南省许昌市,23_2305= 黑龙江省双鸭山市,45_4504= 广西壮族自治区梧州市,13_1301= 河北省石家庄市,23_2307= 黑龙江省伊春市,22_2206= 吉林省白山市,21_2109= 辽宁省阜新市,45_4503= 广西壮族自治区桂林市,50_500109= 重庆市北碚区,50_500105= 重庆市江北区,53_5323= 云南省楚雄彝族自治州,50_500111= 重庆市双桥区,34_3407= 安徽省铜陵市,14_1408= 山西省运城市,46_4601= 海南省海口市,43_4309= 湖南省益阳市,41_4105= 河南省安阳市,11_110108= 北京市海淀区,13_1305= 河北省邢台市,62_6229= 甘肃省临夏回族自治州,42_4228= 湖北省恩施土家族苗族自治州,54_5426= 西藏林芝地区,50_500237= 重庆市巫山县,34_3401= 安徽省合肥市,21_2102= 辽宁省大连市,37_3703= 山东省淄博市,50_500102= 重庆市涪陵区,34_3402= 安徽省芜湖市,53_5305= 云南省保山市,62_6205= 甘肃省天水市,50_500242= 重庆市酉阳土家族苗族自治县,41_4109= 河南省濮阳市,51_5103= 四川省自贡市,65_6501= 新疆乌鲁木齐市,52_5202= 贵州省六盘水市,62_6209= 甘肃省酒泉市,51_5106= 四川省德阳市,11_110116= 北京市怀柔区,23_2304= 黑龙江省鹤岗市,44_4413= 广东省惠州市,45_4514= 广西壮族自治区崇左市,50_500233= 重庆市忠县,21_2107= 辽宁省锦州市,37_3713= 山东省临沂市,45_4506= 广西壮族自治区防城港市,12_120102= 天津市河东区,34_3414= 安徽省巢湖市,61_6107= 陕西省汉中市,31_3102= 上海市县,23_2303= 黑龙江省鸡西市,11_110115= 北京市大兴区,43_4301= 湖南省长沙市,41_4117= 河南省驻马店市,33_3304= 浙江省嘉兴市,34_3405= 安徽省马鞍山市,43_4312= 湖南省怀化市,50_500230= 重庆市丰都县,11_110229= 北京市延庆县,45_4507= 广西壮族自治区钦州市,62_6230= 甘肃省甘南藏族自治州,11_110111= 北京市房山区,44_4404= 广东省珠海市,21_2113= 辽宁省朝阳市,12_120113= 天津市北辰区,37_3702= 山东省青岛市,41_4103= 河南省洛阳市,13_1310= 河北省廊坊市,50_500101= 重庆市万州区,15_1506= 内蒙古鄂尔多斯市,51_5118= 四川省雅安市,34_3412= 安徽省阜阳市,42_4209= 湖北省孝感市,51_5104= 四川省攀枝花市,62_6211= 甘肃省定西市,32_3207= 江苏省连云港市,34_3415= 安徽省六安市,65_6522= 新疆哈密地区,45_4501= 广西壮族自治区南宁市,33_3303= 浙江省温州市,41_4106= 河南省鹤壁市,31_310117= 上海市松江区,41_4114= 河南省商丘市,50_500232= 重庆市武隆县,11_110114= 北京市昌平区,50_500241= 重庆市秀山土家族苗族自治县,51_5111= 四川省乐山市,61_6109= 陕西省安康市,45_4509= 广西壮族自治区玉林市,31_310114= 上海市嘉定区,31_310110= 上海市杨浦区,31_310104= 上海市徐汇区,42_4210= 湖北省荆州市,21_2108= 辽宁省营口市,52_5224= 贵州省毕节地区,12_120110= 天津市东丽区,53_5325= 云南省红河哈尼族彝族自治州,50_500107= 重庆市九龙坡区,64_6404= 宁夏固原市,41_4102= 河南省开封市,61_6104= 陕西省咸阳市,43_4304= 湖南省衡阳市,43_4305= 湖南省邵阳市,21_2105= 辽宁省本溪市,41_4112= 河南省三门峡市,36_3601= 江西省南昌市,51_5117= 四川省达州市,62_6212= 甘肃省陇南市,22_2204= 吉林省辽源市,45_4510= 广西壮族自治区百色市,62_6206= 甘肃省武威市,61_6106= 陕西省延安市,44_4418= 广东省清远市,37_3709= 山东省泰安市,50_500240= 重庆市石柱土家族自治县,54_5421= 西藏昌都地区,62_6204= 甘肃省白银市,15_1509= 内蒙古乌兰察布市,54_5424= 西藏那曲地区,22_2201= 吉林省长春市,50_500119= 重庆市南川区,50_500243= 重庆市彭水苗族土家族自治县,15_1502= 内蒙古包头市,43_4310= 湖南省郴州市,54_5422= 西藏山南地区}";
}
